sencercoltu/openvr-customhmd/stm32/TrackedDevice/Src/main.c
						//if (now - lastPositionSend >= 20000) //50 ms
						{
							positionQuat.w = 0;
							positionQuat.x = position.Position[0];
							positionQuat.y = position.Position[1];
							positionQuat.z = position.Position[2];
							
							positionQuat = (orientQuat * positionQuat) * orientQuat.conjugate();
							
							hasPositionData = 1;							
							//lastPositionSend = now;	
						}
						
						//lastPositionIntegrateTime = now;
					}
				}
				//else
				//	lastPositionIntegrateTime = now;
			}
		}

		rfStatus = RF_Status(&hspi2);
		readyToReceive = (rfStatus & RF_RX_DR_IRQ_CLEAR) == RF_RX_DR_IRQ_CLEAR ? 1 : 0;

		if (readyToReceive)
		{
			rfStatus = RF_FifoStatus(&hspi2);
			readyToReceive = (rfStatus & RF_RX_FIFO_EMPTY_Bit) == 0x00 ? 1: 0;
			while (readyToReceive)
			{			
				rcvCounter++;
				//receive command
				//has fifo, receive
				readyToReceive = RF_ReceivePayload(&hspi2, (uint8_t*)pUSBCommandPacket, sizeof(USBPacket)) == 0 ? 1: 0; //if not empty 
				
				if (CheckPacketCrc(pUSBCommandPacket) && ((pUSBCommandPacket->Header.Type & 0x0F)) == ctlSource)
				{
					if (lastCommandSequence != pUSBCommandPacket->Header.Sequence) //discard duplicates
					{
						lastCommandSequence = pUSBCommandPacket->Header.Sequence; 
						switch (pUSBCommandPacket->Command.Command)
						{
							case CMD_RAW_DATA:								
								feedRawMode = (RawModes) pUSBCommandPacket->Command.Data.Raw.State;
								break;
							case CMD_VIBRATE:
								if (pUSBCommandPacket->Command.Data.Vibration.Axis == 0)
								{
									vibrationStopTime0 = ticks + pUSBCommandPacket->Command.Data.Vibration.Duration;
									HAL_GPIO_WritePin(CTL_VIBRATE0_GPIO_Port, CTL_VIBRATE0_Pin, GPIO_PIN_SET);							
								}
								else if (pUSBCommandPacket->Command.Data.Vibration.Axis == 1)
								{
									vibrationStopTime1 = ticks + pUSBCommandPacket->Command.Data.Vibration.Duration;
									HAL_GPIO_WritePin(CTL_VIBRATE1_GPIO_Port, CTL_VIBRATE1_Pin, GPIO_PIN_SET);							
								}
								break;
							case CMD_CALIBRATE:
								//manually set sensor offsets
								int sensorId = pUSBCommandPacket->Command.Data.Calibration.Sensor;									
								if (pUSBCommandPacket->Command.Data.Calibration.Command == CALIB_GET)							
								{
									SensorCalibRequest = sensorId;
								}
								else
								{
									for (int i=0; i<3; i++)
									{
										position.Position[i] = 0;
										VelocityVector[i] = 0;
										//AccelVector[i] = 0;
										CompAccelVector[i] = 0;
									}
									if (sensorId == SENSOR_NONE)
										break;
									else if (sensorId == SENSOR_ACCEL)
										calibrationCache.Accel = pUSBCommandPacket->Command.Data.Calibration;
									else if (sensorId == SENSOR_GYRO)
										calibrationCache.Gyro = pUSBCommandPacket->Command.Data.Calibration;
									else if (sensorId == SENSOR_MAG)
										calibrationCache.Mag = pUSBCommandPacket->Command.Data.Calibration;
									eepromSaveTime = ticks + 1000; //save after 1 second
									//lastPositionIntegrateTime = 
									//lastPositionSend = now;
								}
								break;
						}
					}
					pUSBCommandPacket->Header.Type = 0xff;				
				}									
			}
		}		
		
		if (((SensorCalibRequest != 0xFF) || hasRotationData || feedRawMode || hasPositionData || buttonRetransmit) && ticks >= nextSend)
		{
			rfStatus = RF_FifoStatus(&hspi2); readyToSend = (rfStatus & RF_TX_FIFO_FULL_Bit) == 0x00 ? 1 : 0;			
		}
		
		if (readyToSend)
		{
			RF_TransmitMode(&hspi2, RF_InitStruct.RF_TX_Adress); //switch to tx mode
			//HAL_MicroDelay(10);			
			blinkDelay = 100;

			sndCounter++;
			
			//RF_DisableTransmit(&hspi2);
			
			//rfStatus = RF_Status(&hspi2); readyToSend = (rfStatus & RF_TX_STATUS_FULL_Bit) == 0x00 ? 1 : 0;	
			//sendTurn = (sendTurn + 1) % 4;
			
			//4 types of data				
			//uint8_t currTurn = sendTurn;
			
			//if (currTurn == 0)
			{
				if (SensorCalibRequest != 0xFF)
				{
					USBDataPacket.Header.Type = ctlSource | COMMAND_DATA;
					USBDataPacket.Header.Sequence++;				
					USBDataPacket.Command.Command = CMD_CALIBRATE;
					if (SensorCalibRequest == SENSOR_ACCEL)
						USBDataPacket.Command.Data.Calibration = calibrationCache.Accel;
					else if (SensorCalibRequest == SENSOR_GYRO)
						USBDataPacket.Command.Data.Calibration = calibrationCache.Gyro;
					else if (SensorCalibRequest == SENSOR_MAG)
						USBDataPacket.Command.Data.Calibration = calibrationCache.Mag;
					USBDataPacket.Command.Data.Calibration.Command = CALIB_GET;
					USBDataPacket.Command.Data.Calibration.Sensor = SensorCalibRequest;
					SensorCalibRequest = 0xFF;
					SetPacketCrc(&USBDataPacket);				
					RF_SendPayload(&hspi2, (uint8_t*)&USBDataPacket, sizeof(USBPacket));
				}
				
				if (feedRawMode)
				{	
					//sendTurn = currTurn;
					//send raw data
					USBDataPacket.Header.Type = ctlSource | COMMAND_DATA;
					USBDataPacket.Header.Sequence++;				
					USBDataPacket.Command.Command = CMD_RAW_DATA;
					USBDataPacket.Command.Data.Raw.State = feedRawMode;
					for (int idx=0; idx<3; idx++)
					{
						switch(feedRawMode)
						{
							case RawMode_Off:
								break;
							case RawMode_Raw:
							{
								//raw sensor values
								USBDataPacket.Command.Data.Raw.Accel[idx] = tSensorData.Accel.Raw[idx];
								USBDataPacket.Command.Data.Raw.Gyro[idx] = tSensorData.Gyro.Raw[idx];
								USBDataPacket.Command.Data.Raw.Mag[idx] = tSensorData.Mag.Raw[idx];
								break;
							}
							case RawMode_Filtered:
							{
								//filtered sensor data
								USBDataPacket.Command.Data.Raw.Accel[idx] = tSensorData.Accel.Filtered[idx];
								USBDataPacket.Command.Data.Raw.Gyro[idx] = tSensorData.Gyro.Filtered[idx];
								USBDataPacket.Command.Data.Raw.Mag[idx] = tSensorData.Mag.Filtered[idx];
								break;
							}
							case RawMode_Compensated:
							{
								//compensated sensor data
								USBDataPacket.Command.Data.Raw.Accel[idx] = tSensorData.Accel.Compensated[idx];
								USBDataPacket.Command.Data.Raw.Gyro[idx] = tSensorData.Gyro.Compensated[idx];
								USBDataPacket.Command.Data.Raw.Mag[idx] = tSensorData.Mag.Compensated[idx];
								break;
							}
							case RawMode_DRVectors:
							{
								//deadreckoning vectors
								USBDataPacket.Command.Data.Raw.Accel[idx] = (int16_t)(GravityVector[idx] / aRes);
								USBDataPacket.Command.Data.Raw.Gyro[idx] = (int16_t)(CompAccelVector[idx] / aRes); //in m/s2
								USBDataPacket.Command.Data.Raw.Mag[idx] = VelocityVector[idx] * 1000; //in mm/s
								break;
							}
						}
					}
					SetPacketCrc(&USBDataPacket);				
					RF_SendPayload(&hspi2, (uint8_t*)&USBDataPacket, sizeof(USBPacket));
					//rfStatus = RF_FifoStatus(&hspi2); readyToSend = (rfStatus & RF_TX_FIFO_FULL_Bit) == 0x00 ? 1 : 0;
				}
				//else 
				//	currTurn++;
			}
			//if (currTurn == 1)
			//{	
				if (hasPositionData)
				{					
					//sendTurn = currTurn;
					//send position
					hasPositionData = 0;				
					USBDataPacket.Header.Type = ctlSource | POSITION_DATA;
					USBDataPacket.Header.Sequence++;
					
					//remap
					USBDataPacket.Position.Position[0] = positionQuat.x; //position.Position[0];
					USBDataPacket.Position.Position[1] = positionQuat.z; //position.Position[2];
					USBDataPacket.Position.Position[2] = -positionQuat.y; //-position.Position[1];
					SetPacketCrc(&USBDataPacket);				
					RF_SendPayload(&hspi2, (uint8_t*)&USBDataPacket, sizeof(USBPacket));
					//rfStatus = RF_FifoStatus(&hspi2); readyToSend = (rfStatus & RF_TX_FIFO_FULL_Bit) == 0x00 ? 1 : 0;					
				}
				//else 
				//	currTurn++;
			//} 
			//if (currTurn == 2)
			//{				
				if (hasRotationData)
				{			
					//sendTurn = currTurn;					
					//send rot data
					hasRotationData = 0;				
					USBDataPacket.Header.Type = ctlSource | ROTATION_DATA;
					USBDataPacket.Header.Sequence++;
					//remap				
					USBDataPacket.Rotation.w = orientQuat.w;
					USBDataPacket.Rotation.x = orientQuat.x;
					USBDataPacket.Rotation.y = orientQuat.z;
					USBDataPacket.Rotation.z = -orientQuat.y;					
					SetPacketCrc(&USBDataPacket);				
					RF_SendPayload(&hspi2, (uint8_t*)&USBDataPacket, sizeof(USBPacket));
					//rfStatus = RF_FifoStatus(&hspi2); readyToSend = (rfStatus & RF_TX_FIFO_FULL_Bit) == 0x00 ? 1 : 0;	
				}			
				//else
				//	currTurn++;
			//} 
			//if (currTurn == 3)
			//{
				if (buttonRetransmit)
				{			
					//sendTurn = currTurn;					
					//send trigger data				
					buttonRetransmit--;				
					USBDataPacket.Header.Type = ctlSource | TRIGGER_DATA;
					USBDataPacket.Header.Sequence++;				
					USBDataPacket.Trigger.Analog[0].x = ((float)ADC_Cache[0]) / 100.0f; //trigger
					USBDataPacket.Trigger.Analog[0].y = ((float)ADC_Cache[1]) / 100.0f; //IPD
					USBDataPacket.Trigger.Analog[1].x = 0; //reserved
					USBDataPacket.Trigger.Analog[1].y = 0; //reserved
					
					USBDataPacket.Trigger.Digital = DigitalCache;
					SetPacketCrc(&USBDataPacket);				
					RF_SendPayload(&hspi2, (uint8_t*)&USBDataPacket, sizeof(USBPacket));				
					rfStatus = RF_FifoStatus(&hspi2); readyToSend = (rfStatus & RF_TX_FIFO_FULL_Bit) == 0x00 ? 1 : 0;									
				}
				//currTurn++;
			//}			
			
			//RF_EnableTransmit(&hspi2);
			//if (!(hasRotationData | hasPositionData | buttonRetransmit | feedRawData))
			do { rfStatus = RF_FifoStatus(&hspi2); } while ((rfStatus & RF_TX_FIFO_EMPTY_Bit) != RF_TX_FIFO_EMPTY_Bit); //wait for send complete			
			
			if (!(feedRawMode || hasPositionData || hasRotationData || buttonRetransmit))
				nextSend = ticks + (extraDelay + (rand() % 10));
			readyToSend = 0;

			HAL_MicroDelay(10);
			RF_ReceiveMode(&hspi2, RF_InitStruct.RF_RX_Adress_Pipe0); //back to rx mode
			//
			//continue;
		}
	}
  /* USER CODE END WHILE */

